Autodesk.Revit.Exceptions.InternalException.GetObjectData(System.Runtime.Serialization.SerializationInfo,System.Runtime.Serialization.StreamingContext)
Retrieves data needed to serialize the target object.
info:
Data needed to serialize or deserialize the object.
context:
The destination of the serialized stream.

Autodesk.Revit.Exceptions.InternalException
The exception that is thrown when an issue in the Revit code resulted in an unexpected error.
Remarks: Please contact Autodesk Developer Support with the information about what led to this exception.